art_share/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Monet"], ["created_at", "2023-02-16 22:14:48.742564"], ["updated_at", "2023-02-16 22:14:48.742564"]]
---
    def create
        user = User.new(user_params)

        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 24]]
---
    def destroy
        @user = User.find(params[:id])

        if @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "DA vinci"], ["updated_at", "2023-02-16 22:30:38.017158"], ["id", 23]]
---
    def update
        @user = User.find(params[:id])

        if @user.update(user_params)